'use client';

// privacy policy
export default function Privacy() {
    return (
        <div className='prose dark:prose-invert w-full mx-auto max-w-prose'>
            <h1>隐私策略</h1>
            <h4 className='mb-6'>最后更新: 2024-03-15</h4>

            <p className='indent-8'>
                在KForum（以下或称“我们”），我们非常重视您的个人信息与隐私保护。
                请阅读本隐私政策，了解我们如何处理您的个人数据。
                以任何方式使用或访问我们的服务，即表示您承认您接受以下概述的做法和政策，并且您特此同意我们将按照本隐私政策所述收集、使用和共享您的信息。
            </p>

            <h3>本隐私政策涵盖的内容</h3>
            <p className='indent-8'>
                本隐私政策涵盖我们如何处理您在您访问或使用我们的服务时收集的个人数据。
                “个人数据”是指识别特定个人或与特定个人相关的任何信息，还包括根据适用的数据隐私法律、法规或法规称为“个人身份信息”或“个人信息”的信息。
                您还可以根据以下索引读取您感兴趣的章节，进一步了解更详细信息：
            </p>
            <ul>
                <li>我们如何获取您的个人信息</li>
                <li>我们如何使用您的个人信息</li>
                <li>我们如何保护您的个人信息</li>
                <li>我们存储您的个人信息的地点和时限</li>
                <li>我们如何共享您的个人信息</li>
                <li>未成年人</li>
                <li>变更</li>
            </ul>

            <h3>我们如何获取您的个人信息</h3>
            <p className='indent-8'>
                我们根据合法、正当、必要的原则，获取您在使用注册、登录、发布、回复、搜索、关注、收藏等服务时，
                主动提供或因使用服务而产生的信息，用于向您提供服务、优化我们的服务以及保障您的账号安全。
            </p>

            <h3>我们如何使用您的个人信息</h3>
            <p className='indent-8'>我们会严格依据服务器所在地的法律法规及与您的约定将所获取的信息用于向您提供服务，安全保障和与您沟通。</p>
            <ul>
                <li>提供的服务包含注册、登录、发布、回复、搜索、关注、收藏等。</li>
                <li>安全保障包括密码找回、安全分析与记录，异常提醒等。</li>
                <li>我们会在某些场景下与您进行沟通。例如，当您向我们发起投诉、申诉或进行咨询时，我们会保存您与我们的沟通记录、与您的需求相关的其他必要信息，以便解决您可能遇到的任何问题。</li>
            </ul>

            <h3>我们如何保护您的个人信息</h3>
            <p className='indent-8'>
                我们会为您的信息安全提供保障，以防止信息的丢失、不当使用、未经授权访问或披露。
                为此，我们将通过多方面的合理合法的安全措施来保护您的个人信息。
                例如，使用加密、脱敏、防火墙等技术手段、以及建立安全规章制度，定期举行安全演练等行政手段。
            </p>

            <h3>我们存储您的个人信息的地点和时限</h3>
            <p className='indent-8'>我们遵守服务器所在地的法律的规定，将个人信息存储于服务器所在地。</p>
            <p className='indent-8'>
                一般而言，我们仅在为实现目的所必需的最短时间内保留您的个人信息。但在法律政策的要求下，我们有可能会调整个人信息的存储时间。
            </p>
            <p className='indent-8'>
                在超出必要存储期限，或者当我们的产品或服务发生停止运营的情形时，我们将在合理的期限内删除或匿名化处理您的个人信息。
            </p>

            <h3>我们如何共享您的个人信息</h3>
            <p className='indent-8'>您的个人信息不会共享到相关产品以外的情况，但是以下情况除外：</p>
            <ul>
                <li>根据法律法规、诉讼、争议解决需要，或按行政、司法机关依法提出的要求</li>
                <li>事先获得您的明确同意或授权</li>
                <li>在法律要求或允许的范围内，为保护善时及其用户、雇员的人身财产安全或社会公众的利益、财产、安全免遭损害</li>
            </ul>
            <p className='indent-8'>如我们与合作伙伴共享您的信息，我们将会采用加密、匿名化处理等手段保障您的信息安全。</p>
            <p className='indent-8'>
                您应当理解，我们的很多服务都允许您与其他人分享您的相关信息，并且您可以控制分享的方式。
                您当然可以删除您公开分享的信息。
                但请注意，您因为这些主动共享、披露行为导致您个人信息被他人知晓的，我们不承担相关责任。
            </p>

            <h3>未成年人</h3>
            <p className='indent-8'>我们的产品设计初衷并不特别适用于 18 周岁以下的未成年人。</p>
            <p className='indent-8'>
                若您是 18 周岁以下的未成年人，在使用我们的服务前，应在您监护人的监护、指导下共同阅读并同意本隐私政策。
                若您未经监护人允许使用了我们的服务，我们将采取措施删除您的个人信息。
            </p>

            <h3>变更</h3>
            <p className='indent-8'>本隐私政策将来可能会进行修改，以使其与服务器所在地的法律和相关政策保持同步。我们将在变更后通过产品内部或电子邮件等方式进行变更提示。</p>
            <p className='indent-8'>若您在变更后继续使用我们的服务，即表示您充分阅读、理解并同意受更新后的隐私政策约束。</p>
        </div>
    );
}
